book-review1/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Top Esports"], ["body", "Strong\r\n"], ["created_at", "2020-09-16 15:02:10.539476"], ["updated_at", "2020-09-16 15:02:10.539476"]]
---
  def create
  	book = Book.new(book_params)
  	book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def update
    book = Book.find(params[:id])